thinker69155/DevelopmentCode/STM32MCU/STDLproject/projectpack/TIM_IC2/stm32f1xx_blink_demo-template/source/HardWare/IC.c
#include "stm32f10x.h"

void IC_Init()
{
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3,ENABLE);
    TIM_InternalClockConfig(TIM3);//内部时钟（默认）
    //GPIO初始化
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Mode=GPIO_Mode_IPU;//复用推挽输出
    GPIO_InitStructure.GPIO_Pin=GPIO_Pin_6;
    GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
    GPIO_Init(GPIOA,&GPIO_InitStructure);



    //时基单元
    TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
    TIM_TimeBaseInitStructure.TIM_ClockDivision=TIM_CKD_DIV1;//外部时钟滤波使用，这里非外部可直接不分频
    TIM_TimeBaseInitStructure.TIM_CounterMode=TIM_CounterMode_Up;//向上计数
    TIM_TimeBaseInitStructure.TIM_Period=65536-1;//1s   //ARR
    TIM_TimeBaseInitStructure.TIM_Prescaler=72-1;     //PSC
    TIM_TimeBaseInitStructure.TIM_RepetitionCounter=0;
    TIM_TimeBaseInit(TIM3,&TIM_TimeBaseInitStructure);
    
    //初始化输入比较单元

    TIM_ICInitTypeDef TIM_ICInitStrcture;
    TIM_ICInitStrcture.TIM_Channel=TIM_Channel_1;
    TIM_ICInitStrcture.TIM_ICFilter=0xF;
    TIM_ICInitStrcture.TIM_ICPolarity=TIM_ICPolarity_Rising;
    TIM_ICInitStrcture.TIM_ICPrescaler=TIM_ICPSC_DIV1;
    TIM_ICInitStrcture.TIM_ICSelection=TIM_ICSelection_DirectTI;
    TIM_PWMIConfig(TIM3,&TIM_ICInitStrcture);

    //主从触发模式配置
    TIM_SelectInputTrigger(TIM3,TIM_TS_TI1FP1);
    TIM_SelectSlaveMode(TIM3,TIM_SlaveMode_Reset);

    //启动定时器
    TIM_Cmd(TIM3,ENABLE);
}

uint32_t IC_GetFreq()
{
    return 1000000/(TIM_GetCapture1(TIM3)+1);
}

uint32_t IC_GetDuty()
{
    return (TIM_GetCapture2(TIM3)+1)*100/(TIM_GetCapture1(TIM3)+1);
} 